CSI API ETABS v1
cFrameObj.GetCurved_2 Method
 Retrieves frame object curve data
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCurved_2(
	string Name,
	ref int CurveType,
	ref double Tension,
	ref int NumPnts,
	ref double[] gx,
	ref double[] gy,
	ref double[] gz
)
Function GetCurved_2 (
	Name As String,
	ByRef CurveType As Integer,
	ByRef Tension As Double,
	ByRef NumPnts As Integer,
	ByRef gx As Double(),
	ByRef gy As Double(),
	ByRef gz As Double()
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim CurveType As Integer
Dim Tension As Double
Dim NumPnts As Integer
Dim gx As Double()
Dim gy As Double()
Dim gz As Double()
Dim returnValue As Integer
returnValue = instance.GetCurved_2(Name,
	CurveType, Tension, NumPnts, gx, gy,
	gz)
int GetCurved_2(
	String^ Name,
	int% CurveType,
	double% Tension,
	int% NumPnts,
	array<double>^% gx,
	array<double>^% gy,
	array<double>^% gz
)
abstract GetCurved_2 :
        Name : string *
        CurveType : int byref *
        Tension : float byref *
        NumPnts : int byref *
        gx : float[] byref *
        gy : float[] byref *
        gz : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing curved frame object
CurveType
Type: System.Int32
 The type of curve, this is an integer from the following list:
Straight = 0
Circular Curve = 1
Multilinear Curve = 2
Bezier Curve = 3
Spline Curve = 4
Tension
Type: System.Double
 Used for spline, a value that specifies the amount that the curve bends between control points. Values greater than 1 produce unpredictable results
NumPnts
Type: System.Int32
 The number of points along the curve
gx
Type: System.Double[]
 An array of size NumPnts, the global X coordinates
gy
Type: System.Double[]
 An array of size NumPnts, the global Y coordinates
gz
Type: System.Double[]
 An array of size NumPnts, the global Z coordinates
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns a nonzero value
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace